# FramingLengthRoundoff Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..FramingLengthRoundoff Property
ParameterTypeId Class See Also
---
"Structural Framing Length Roundoff"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId FramingLengthRoundoff { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property FramingLengthRoundoff As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ FramingLengthRoundoff {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace